In [1]:
# SQL

In [2]:
import sqlite3

In [26]:
db1=sqlite3.connect("test.db")
db1.execute("drop table if exists grades1")
db1.execute("create table grades1(id int, name text,score int)")
db1.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db1.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db1.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db1.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db1.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [27]:
db.commit()

In [35]:
result = db.execute("select * from grades1 where name='Gary'")
for i in result:
    print(i)

(102, 'Gary', 90)

In [5]:
import pandas as pd
import numpy as np
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t') 
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [43]:
titanic_train[['Name','Sex','Cabin','Embarked']].describe()

                                Name   Sex Cabin Embarked
count                            156   156    31      155
unique                           156     2    28        3
top     West, Miss. Constance Mirium  male   D26        S
freq                               1   100     2      110

In [49]:
a=titanic_train.dtypes[titanic_train.dtypes=='object'].index

In [51]:
titanic_train[a].describe()

                                Name   Sex  Ticket Cabin Embarked
count                            156   156     156    31      155
unique                           156     2     145    28        3
top     West, Miss. Constance Mirium  male  113803   D26        S
freq                               1   100       2     2      110

In [55]:
sorted(titanic_train["Name"])[10:15]

['Attalah, Miss. Malake',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Barton, Mr. David John',
 'Bateman, Rev. Robert James',
 'Baxter, Mr. Quigg Edmond']

In [59]:
titanic_train["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [66]:
new_survived=pd.Categorical(titanic_train["Survived"])
new_survived=new_survived.rename_categories(['Died','Survived'])
new_survived

[Died, Survived, Survived, Survived, Died, ..., Survived, Died, Died, Died, Died]
Length: 156
Categories (2, object): [Died, Survived]

In [69]:

new =pd.Categorical(titanic_train["Pclass"])
new=new.rename_categories(['one','two','three'])
new

[three, one, three, one, three, ..., one, three, three, three, one]
Length: 156
Categories (3, object): [one, two, three]

In [71]:
titanic_train["new"]=new
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,three
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,one
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,three
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,one
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,three

In [79]:
char_cabin = titanic_train["Cabin"].astype(str)
new_Cabin = np.array([Cabin[0] for Cabin in char_cabin])
new_Cabin = pd.Categorical(new_Cabin)
new_Cabin

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [83]:
dummy_vector=pd.Series([1,None,3,None,7,8,8])
dummy_vector.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [1]:
titanic_train.head()['Age']

NameError: name 'titanic_train' is not defined

In [92]:
missing=np.where(titanic_train["Age"].isnull()==False)
missing

(array([  0,   1,   2,   3,   4,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  18,  20,  21,  22,  23,  24,  25,  27,  30,  33,
         34,  35,  37,  38,  39,  40,  41,  43,  44,  49,  50,  51,  52,
         53,  54,  56,  57,  58,  59,  60,  61,  62,  63,  66,  67,  68,
         69,  70,  71,  72,  73,  74,  75,  78,  79,  80,  81,  83,  84,
         85,  86,  88,  89,  90,  91,  92,  93,  94,  96,  97,  98,  99,
        100, 102, 103, 104, 105, 106, 108, 110, 111, 112, 113, 114, 115,
        116, 117, 118, 119, 120, 122, 123, 124, 125, 127, 129, 130, 131,
        132, 133, 134, 135, 136, 137, 138, 139, 141, 142, 143, 144, 145,
        146, 147, 148, 149, 150, 151, 152, 153, 155], dtype=int64),)

In [93]:
titanic_train["Age"].isnull()==False

0       True
1       True
2       True
3       True
4       True
       ...
151     True
152     True
153     True
154    False
155     True
Name: Age, Length: 156, dtype: bool

In [25]:
missing1=np.where(titanic_train["PassengerId"]<10)

In [26]:
titanic_train.loc[missing1]["Name"]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Name: Name, dtype: object

In [3]:
missing2=np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))
titanic_train.iloc[missing2]["Name"]

27    Fortune, Mr. Charles Alexander
88        Fortune, Miss. Mabel Helen
Name: Name, dtype: object

In [4]:
missing2=np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))
titanic_train.loc[missing2]["Name"]

27    Fortune, Mr. Charles Alexander
88        Fortune, Miss. Mabel Helen
Name: Name, dtype: object

In [10]:
lables=['a','b','c']
my_data=[10,20,30]
a=pd.Series(my_data,index=lables)
a['a']

10

In [1]:
d= {"a":"sdsd","b":"wdwd"}

In [19]:
pd.DataFrame(d,index =["b"])

      a     b
b  sdsd  wdwd

In [18]:
list1=[1,2,3,4,5]
pd.Series(list1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
series1= pd.Series([1,2,3,4],["CA","NM","OR","CA"])
series2= pd.Series([1,2,3,4],["CA","JK","MM","EK"])
series1+series2

CA    2.0
CA    5.0
EK    NaN
JK    NaN
MM    NaN
NM    NaN
OR    NaN
dtype: float64

In [26]:
from numpy.random import rand as rn

In [40]:
my_data=rn(5,4)
label=["A","b","C","D","E"]
col=["W","X","Y","Z"]
df=pd.DataFrame(my_data,label,col)
df

          W         X         Y         Z
A  0.171702  0.684932  0.340712  0.650076
b  0.972461  0.599047  0.396062  0.151059
C  0.078406  0.198042  0.995380  0.004543
D  0.001604  0.061978  0.642853  0.189310
E  0.114612  0.327326  0.465385  0.213370

In [51]:
df['NEW']=df["X"]+df["Z"]
df.drop("Y",axis=1,inplace=True)

In [59]:
df.iloc[:,[1,2]]

          X         Z
A  0.684932  0.650076
b  0.599047  0.151059
C  0.198042  0.004543
D  0.061978  0.189310
E  0.327326  0.213370

In [64]:
df[df['X']>.2]

          W         X         Z       NEW
A  0.171702  0.684932  0.650076  1.335008
b  0.972461  0.599047  0.151059  0.750106
E  0.114612  0.327326  0.213370  0.540696

In [69]:
matrix_data=np.matrix('22,66,140;23,67,167;34,70,178;33,55,189')
lable=["Age","Weight",'Height']
index=["A","b",'c','d']
pf=pd.DataFrame(matrix_data,index,lable)

In [75]:
pf[pf['Height']<175]['Age']

A    22
b    23
Name: Age, dtype: int32

In [88]:
df

          W         X         Z  profession
A  0.171702  0.684932  0.650076     Student
b  0.972461  0.599047  0.151059     teacher
C  0.078406  0.198042  0.004543    watchman
D  0.001604  0.061978  0.189310  shopkeeper
E  0.114612  0.327326  0.213370      father

In [89]:
df["profession"]= "Student teacher watchman shopkeeper father".split()
df.set_index('profession')

                   W         X         Z
profession
Student     0.171702  0.684932  0.650076
teacher     0.972461  0.599047  0.151059
watchman    0.078406  0.198042  0.004543
shopkeeper  0.001604  0.061978  0.189310
father      0.114612  0.327326  0.213370

In [107]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [108]:
df1=pd.DataFrame(data=np.round(rn(6,3)),index=hier_index,columns=['A','B','C'])

In [117]:
df1.loc['G2'].loc[2:,['B','C']]

     B    C
2  0.0  0.0
3  1.0  0.0

In [111]:
df1

        A    B    C
G1 1  0.0  0.0  1.0
   2  0.0  1.0  0.0
   3  1.0  0.0  0.0
G2 1  1.0  0.0  1.0
   2  1.0  0.0  0.0
   3  1.0  1.0  0.0